Revit 2026 API

# FabricationPartRouteEnd Class

---

Class to hold fabrication part routing start or end information.

SystemObject Autodesk.Revit.DB.FabricationFabricationPartRouteEnd

**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FabricationPartRouteEnd : IDisposable
```
```vb
Public Class FabricationPartRouteEnd
	Implements IDisposable
```
```cpp
public ref class FabricationPartRouteEnd : IDisposable
```
```fsharp
type FabricationPartRouteEnd =
    class
        interface IDisposable
    end
```

The FabricationPartRouteEnd type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | CreateFromCenterline | Create fabrication routing end from centerline point on straight element. |
|  | CreateFromConnector | Create fabrication routing end from connector end point. |
|  | Dispose | Releases all resources used by the FabricationPartRouteEnd |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

To create a new instance, use CreateFromConnector(Connector) to specify a connector, or CreateFromCenterline(Element, XYZ) to specify the centerline of a straight element, for the fabrication routing end point.

#### Reference

Autodesk.Revit.DB.Fabrication Namespace